app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Kotomi Ann"], ["updated_at", "2021-01-16 20:17:19.527266"], ["id", 3]]
---
  def update
    @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_student
    @student = Student.find_by_id(params[:id])